In [4]:
import pandas as pd

In [9]:
data = [12,23,54]
df = pd.DataFrame(data)
df

    0
0  12
1  23
2  54

In [11]:
# dictionar to DataFrame
dd = {'Name':["Tamil", "Sasi"], 'Age':[21,7]}
df1 = pd.DataFrame(dd)
df1

    Name  Age
0  Tamil   21
1   Sasi    7

In [13]:
# Reading CSV File
df2 = pd.read_csv("petrol.csv")
df2

               Date  Delhi  Kolkata  Mumbai  Chennai
0     April 19 2018  74.07    76.77   81.92    76.84
1     April 18 2018  74.02    76.73   81.87    76.79
2     April 17 2018  74.02    76.73   81.87    76.79
3     April 16 2018  74.02    76.73   81.87    76.79
4     April 15 2018  73.98    76.69   81.83    76.75
..              ...    ...      ...     ...      ...
369  August 01 2014  72.51    80.30   80.60    75.78
370    July 01 2014  73.60    81.43   81.75    76.93
371    June 25 2014  71.56    79.42   80.16    74.76
372    June 07 2014  71.51    79.36   80.11    74.71
373    June 01 2014  71.51    79.36   80.11    74.71

[374 rows x 5 columns]

In [14]:
df3 = pd.read_table("new.txt", sep=" ")
df3

          Name  Age
0  Tamilselvan   21
1     Saikumar    7
2        Kavin   21
3        Aathi   21

In [15]:
import numpy as np

In [17]:
dic = {'Name':["vijay", "surya", np.nan], "Age":[33,np.nan,32]}
df4 = pd.DataFrame(dic)
df4

    Name   Age
0  vijay  33.0
1  surya   NaN
2    NaN  32.0

In [21]:
print(df4.isnull())
print(df4.fillna(0))
print(df4.shape)
print(df4.dropna())

    Name    Age
0  False  False
1  False   True
2   True  False
    Name   Age
0  vijay  33.0
1  surya   0.0
2      0  32.0
(3, 2)
    Name   Age
0  vijay  33.0